Revit 2026 API

# SpatialElementTagLeaderElbow Property

---

The position of the leader's elbow (middle point).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ LeaderElbow { get; set; }
```
```vb
Public Property LeaderElbow As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ LeaderElbow {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member LeaderElbow : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | There is no leader for this tag. -or- When setting this property: SpatialElementTag is pinned. -or- When setting this property: SpatialElementTag is orphaned. |

Returns the elbow point of the tag leader.

#### Reference

SpatialElementTag Class

Autodesk.Revit.DB Namespace